export const dataSource = [
    {
        id: 1,
        word: "Algorithm",
        meaning:
            "ក្បួនដែលកុំព្យូទ័រប្រតិបត្តិតាមដើម្បីដោះស្រាយបញ្ហាឬបំពេញកិច្ចការណាមួយ។​",
    }, {
        id: 2,
        word: "Array",
        meaning:
            "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ <code>array[0]</co​",
    }, {
        id: 3,
        word: "Argument",
        meaning:
            "ទិន្នន័យឬតម្លៃដែលបញ្ជូលក្នុងអនុគមន៍ដើម្បីធ្វើការគណនា។ ឧទាហរណ៍៖ អនុគមន៍ <code>function add(x, y) {return x + y}</code> ត្រូវការអាគុយម៉ង់ x និង y ដើម្បីគណនារកចម្លើយ។​",
    }, {
        id: 4,
        word: "Binary",
        meaning: "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ 0 និងលេខ 1 ប្រើប្រាស់ដោយកុំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
    }, {
        id: 5,
        word: "Boolean",
        meaning: "ភាពពិតឬមិនពិត។",
    }, {
        id: 6,
        word: "Artificial Intelligence (AI)",
        meaning: "សំដៅលើ ជ្រុងមួយនៃវិទ្យាសាស្ត្រកុំព្យូទ័រផ្តោតលើការបង្កើត សុសរៃរ កម្មវីធី ឬឧបករណ៍ ដែលមានសមត្ថភាពអាចធ្វើការ សម្រេចចិត្តដោយខ្លួនឯងបាន ឬធ្វើសកម្មភាពជំនួសមនុស្សបាន ។"
    }, {
        id: 7,
        word: "Big Data",
        meaning: "សំដៅលើ សំណុំទិន្នន័យដែលមានបរិមាណច្រើនសន្ធឹកសន្លាប់ ច្រើនប្រភពច្រើនប្រភេទ និងមានកំណើនកើនឡើងយ៉ាងឆាប់រហ័សដែលតម្រូរឱ្យមានវិធីសាស្ត្រនិងបច្ចេកវិទ្យាពិសេសសម្រាប់គ្រប់គ្រង និងវិភាគលើទិន្នន័យទាំងនោះសម្រាប់ជាជំនួយដល់ការសម្រេចចិត្ត និងបម្រើផលប្រយោជន៍ផ្សេងៗទៀត ។"
    }, {
        id: 8,
        word: "Digital Divide",
        meaning: "សំដៅដល់ ភាពខុសគ្នាក្នុងការចាប់យក ឬការមានឳកាសចាប់យកបច្ចេកវិទ្យាឌីជីថល។"
    }, {
        id: 9,
        word: "Collaboration Platform",
        meaning: "សំដៅដល់ថ្នាលដែលប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថល ជាឧបករណ៍សម្រាប់សម្រួលកិច្ចសហការលើកិច្ចការរដ្ឋបាលដែលមានមុខងារសំខាន់ៗ ដូចជា អ៊ីមែល សារជាសម្លែង Chat ការហៅទូរសព្ទតាអាយភី ប្រតិទិន ការតាមដានការងារ និងវិដេអូនៃសន្និសីទ។",
    }, {
        id: 10,
        word: "Courier Service",
        meaning: "សំដៅដល់ សេវាប្រៃសណីយ៍ដែលផ្តាល់ដោយប្រតិបត្តិករឯកជនដោយភ្ជាប់ជាមួយលក្ខណ្ឌអាទិភាព សុវត្ថិភាព ឆាប់រហ័សអាចតាមដានបានដោយប្រព័ន្ធព័ត៌មានវិទ្យា និងកំណត់ដោយក្រសួងប្រៃសណីយ៍និងទូគមនាគមន៍។",
    }, {
        id: 11,
        word: "Cybercrime",
        meaning: "សំដៅដល់ បទល្មើសដែលប្រព្រឹត្តទៅក្នុងបណ្តាញបច្ចេកវិទ្យាគមនាគមន៍និងព័ត៌មាន ដូចជា ការចូលលួច ការក្លែងបន្លំ ឬកែឯកសារ ការចញ្ចូលមេរោគ ការផ្ញើសារគំរាមកំហែង ឬចាប់ជំរិត​ឬ ការធ្វើឳ្យប៉ះពាល់ដល់សន្តិសុខសេដ្ឋកិច្ច និងសង្គមជាតិ។",
    }, {
        id: 12,
        word: "Cybersecurity",
        meaning: "សំដៅដល់ ការអនុវត្តនៃការទប់ស្កាត់ ការឆ្លើយតប និងការការពាករប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន រួចទាំងហេដ្ឋារចនាសម្ព័ន្ធបណ្តាញ ប្រព័ន្ធប្រត្តិបត្តិការ និងកម្មវិធីការជ្រៀតចូល និងការវាយប្រហារគ្រប់រួបភាព ជាពិសេសតាមប្រព័ន្ធអ៊ីនធើណិត។",
    }, {
        id: 13,
        word: "Data Center",
        meaning: "សំដៅដល់ ហេដ្ឋារចនាសម្ព័ន្ធសម្រាប់ផ្តល់សេវាកម្ម ផ្ទុកទិន្នន័យនិងធនធានគណនា សម្រាប់ប្រតិបត្តិការប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន។",
    }, {
        id: 14,
        word: "Data Infrastructure",
        meaning: "សំដៅដល់ ហេដ្ឋារចនាសម្ព័ន្ធឌីជីថលដើម្បីផ្ទុក បំប្លែង និងវិភាគទិន្នន័យ ដើម្បីជំរុញឳ្យមានការផ្លាស់ប្តូរ និងការប្រើប្រាស់ទិន្នន័យ។",
    }, {
        id: 15,
        word: "Web Portal",
        meaning: "សំដៅដល់ ប្រព័ន្ធវិបសាយ ដែលត្រូវបានរៀបចំឡើងតាមរយៈការតភ្ជាប់ជាមួយប្រព័ន្ធឌីជីថលផ្សេងៗ ដើម្បីជាច្រកសម្រាប់ស្វែងរកព័ត៌មាន ឬធ្វើប្រតិបត្តិការសេវាឌីជីថល។",
    },
];