export const dataSource = [
    {
        id: 1,
        word: "Algorithm",
        meaning:
            "ក្បួនដែលកុំព្យូទ័រប្រតិបត្តិតាមដើម្បីដោះស្រាយបញ្ហាឬបំពេញកិច្ចការណាមួយ។​",
    }, {
        id: 2,
        word: "Array",
        meaning:
            "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ <code>array[0]</co​",
    }, {
        id: 3,
        word: "Argument",
        meaning:
            "ទិន្នន័យឬតម្លៃដែលបញ្ជូលក្នុងអនុគមន៍ដើម្បីធ្វើការគណនា។ ឧទាហរណ៍៖ អនុគមន៍ <code>function add(x, y) {return x + y}</code> ត្រូវការអាគុយម៉ង់ x និង y ដើម្បីគណនារកចម្លើយ។​",
    }, {
        id: 4,
        word: "Binary",
        meaning: "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ 0 និងលេខ 1 ប្រើប្រាស់ដោយកុំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
    }, {
        id: 5,
        word: "Boolean",
        meaning: "ភាពពិតឬមិនពិត។",
    }, {
        id: 6,
        word: "Artificial Intelligence (AI)",
        meaning: "សំដៅលើ ជ្រុងមួយនៃវិទ្យាសាស្ត្រកុំព្យូទ័រផ្តោតលើការបង្កើត សុសរៃរ កម្មវីធី ឬឧបករណ៍ ដែលមានសមត្ថភាពអាចធ្វើការ សម្រេចចិត្តដោយខ្លួនឯងបាន ឬធ្វើសកម្មភាពជំនួសមនុស្សបាន ។"
    }, {
        id: 7,
        word: "Big Data",
        meaning: "សំដៅលើ សំណុំទិន្នន័យដែលមានបរិមាណច្រើនសន្ធឹកសន្លាប់ ច្រើនប្រភពច្រើនប្រភេទ និងមានកំណើនកើនឡើងយ៉ាងឆាប់រហ័សដែលតម្រូរឱ្យមានវិធីសាស្ត្រនិងបច្ចេកវិទ្យាពិសេសសម្រាប់គ្រប់គ្រង និងវិភាគលើទិន្នន័យទាំងនោះសម្រាប់ជាជំនួយដល់ការសម្រេចចិត្ត និងបម្រើផលប្រយោជន៍ផ្សេងៗទៀត ។"
    }, {
        id: 8,
        word: "Digital Divide",
        meaning: "សំដៅដល់ ភាពខុសគ្នាក្នុងការចាប់យក ឬការមានឳកាសចាប់យកបច្ចេកវិទ្យាឌីជីថល។"
    },{
        id:9,
        word:"Collaboration Platform",
        meaning:"",
    },
];