export const dataSource = [
    {
        id: 1,
        word: "Algorithm",
        meaning:
            "ក្បួនដែលកុំព្យូទ័រប្រតិបត្តិតាមដើម្បីដោះស្រាយបញ្ហាឬបំពេញកិច្ចការណាមួយ។​",
    }, {
        id: 2,
        word: "Array",
        meaning:
            "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ <code>array[0]</co​de>",
    }, {
        id: 3,
        word: "Argument",
        meaning:
            "ទិន្នន័យឬតម្លៃដែលបញ្ជូលក្នុងអនុគមន៍ដើម្បីធ្វើការគណនា។ ឧទាហរណ៍៖ អនុគមន៍ <code>function add(x, y) {return x + y}</code> ត្រូវការអាគុយម៉ង់ x និង y ដើម្បីគណនារកចម្លើយ។​",
    }, {
        id: 4,
        word: "Binary",
        meaning: "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ <code>0</code> និងលេខ <code>1</code> ប្រើប្រាស់ដោយកុំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
    }, {
        id: 5,
        word: "Boolean",
        meaning: "ភាពពិតឬមិនពិត។",
    }, {
        id: 6,
        word: "Artificial Intelligence (AI)",
        meaning: "សំដៅលើ ជ្រុងមួយនៃវិទ្យាសាស្ត្រកុំព្យូទ័រផ្តោតលើការបង្កើត Software កម្មវីធី ឬឧបករណ៍ ដែលមានសមត្ថភាពអាចធ្វើការ សម្រេចចិត្តដោយខ្លួនឯងបាន ឬធ្វើសកម្មភាពជំនួសមនុស្សបាន ។"
    }, {
        id: 7,
        word: "Big Data",
        meaning: "សំដៅលើ សំណុំទិន្នន័យដែលមានបរិមាណច្រើនសន្ធឹកសន្លាប់ ច្រើនប្រភពច្រើនប្រភេទ និងមានកំណើនកើនឡើងយ៉ាងឆាប់រហ័សដែលតម្រូរឱ្យមានវិធីសាស្ត្រនិងបច្ចេកវិទ្យាពិសេសសម្រាប់គ្រប់គ្រង និងវិភាគលើទិន្នន័យទាំងនោះសម្រាប់ជាជំនួយដល់ការសម្រេចចិត្ត និងបម្រើផលប្រយោជន៍ផ្សេងៗទៀត ។"
    }, {
        id: 8,
        word: "Digital Divide",
        meaning: "សំដៅដល់ ភាពខុសគ្នាក្នុងការចាប់យក ឬការមានឳកាសចាប់យកបច្ចេកវិទ្យាឌីជីថល។"
    }, {
        id: 9,
        word: "Collaboration Platform",
        meaning: "សំដៅដល់ថ្នាលដែលប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថល ជាឧបករណ៍សម្រាប់សម្រួលកិច្ចសហការលើកិច្ចការរដ្ឋបាលដែលមានមុខងារសំខាន់ៗ ដូចជា អ៊ីមែល សារជាសម្លែង Chat ការហៅទូរសព្ទតាអាយភី ប្រតិទិន ការតាមដានការងារ និងវិដេអូនៃសន្និសីទ។",
    }, {
        id: 10,
        word: "Courier Service",
        meaning: "សំដៅដល់ សេវាប្រៃសណីយ៍ដែលផ្តាល់ដោយប្រតិបត្តិករឯកជនដោយភ្ជាប់ជាមួយលក្ខណ្ឌអាទិភាព សុវត្ថិភាព ឆាប់រហ័សអាចតាមដានបានដោយប្រព័ន្ធព័ត៌មានវិទ្យា និងកំណត់ដោយក្រសួងប្រៃសណីយ៍និងទូគមនាគមន៍។",
    }, {
        id: 11,
        word: "Cybercrime",
        meaning: "សំដៅដល់ បទល្មើសដែលប្រព្រឹត្តទៅក្នុងបណ្តាញបច្ចេកវិទ្យាគមនាគមន៍និងព័ត៌មាន ដូចជា ការចូលលួច ការក្លែងបន្លំ ឬកែឯកសារ ការចញ្ចូលមេរោគ ការផ្ញើសារគំរាមកំហែង ឬចាប់ជំរិត​ឬ ការធ្វើឳ្យប៉ះពាល់ដល់សន្តិសុខសេដ្ឋកិច្ច និងសង្គមជាតិ។",
    }, {
        id: 12,
        word: "Cybersecurity",
        meaning: "សំដៅដល់ ការអនុវត្តនៃការទប់ស្កាត់ ការឆ្លើយតប និងការការពាករប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន រួចទាំងហេដ្ឋារចនាសម្ព័ន្ធបណ្តាញ ប្រព័ន្ធប្រត្តិបត្តិការ និងកម្មវិធីការជ្រៀតចូល និងការវាយប្រហារគ្រប់រួបភាព ជាពិសេសតាមប្រព័ន្ធអ៊ីនធើណិត។",
    }, {
        id: 13,
        word: "Data Center",
        meaning: "សំដៅដល់ ហេដ្ឋារចនាសម្ព័ន្ធសម្រាប់ផ្តល់សេវាកម្ម ផ្ទុកទិន្នន័យនិងធនធានគណនា សម្រាប់ប្រតិបត្តិការប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន។",
    }, {
        id: 14,
        word: "Data Infrastructure",
        meaning: "សំដៅដល់ ហេដ្ឋារចនាសម្ព័ន្ធឌីជីថលដើម្បីផ្ទុក បំប្លែង និងវិភាគទិន្នន័យ ដើម្បីជំរុញឳ្យមានការផ្លាស់ប្តូរ និងការប្រើប្រាស់ទិន្នន័យ។",
    }, {
        id: 15,
        word: "Web Portal",
        meaning: "សំដៅដល់ ប្រព័ន្ធវិបសាយ ដែលត្រូវបានរៀបចំឡើងតាមរយៈការតភ្ជាប់ជាមួយប្រព័ន្ធឌីជីថលផ្សេងៗ ដើម្បីជាច្រកសម្រាប់ស្វែងរកព័ត៌មាន ឬធ្វើប្រតិបត្តិការសេវាឌីជីថល។",
    }, {
        id: 16,
        word: "Open Government",
        meaning: "សំដៅលើ គំរូអភិបាលកិច្ច ដែលឈរលើគោលការណ៍តម្លាភាព បើកចំហទិន្នន័យ ផ្តល់នូរទំនុកចិត្តជូនប្រជាពលរដ្ឋ និងមានការ ចូលរួមពីប្រជាពលរដ្ឋក្នុងការសម្រេចចិត្តនានាដូចជា ការអនុម័តគោលនយោបាយ ឬការអនុរត្តគម្រោង ស្របតាមតម្រូវការ របស់ប្រជាពលរដ្ឋ ។",
    }, {
        id: 17,
        word: "Smart Government",
        meaning: "សំដៅដល់ រដ្ឋាភិបាលដែលប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថលថ្មីៗ និងនរានុរត្តន៍ ក្នុងការប្រមូល ដំណើរការ និងវិភាគទិន្នន័យដោយស្វ័យប្ររត្តិ សម្រាប់ជំនួយដល់ការសម្រេចចិត្ត និងការឆ្លើយតបចំពោះបញ្ហា ។",
    }, {
        id: 18,
        word: "Express Mail Server (EMS)",
        meaning: "សំដៅដល់ សេវាប្រៃសណីយ៍ដែលផ្តល់ដោយប្រតិបត្តិករជាតិ ដោយភ្ជាប់ជាមួយលក្ខខណ្ឌអាទិភាព សុវត្ថិភាព ឆាប់រហ័ស អាចតាមដានបានដោយប្រព័ន្ធព័ត៏មានវិទ្យា និងកំណត់ដោយក្រសួងប្រៃសណីយ៍និងទួរគមនាគមន៍ ។",
    }, {
        id: 19,
        word: "Fully transformed Government",
        meaning: "សំដៅដល់ រដ្ឋាភិបាលឌីជីថល ដែលក្រសួងស្ថាប័នទាំងអស់ប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថល និងមានអន្តរប្រតិបត្តិការឌីជីថលល្អប្រសើរសម្រាប់ការគ្រប់គ្រងការងារអភិបាលកិច្ច និងការផ្តល់សេវា ដោយយកចិត្តទុកដាក់ពីតម្រូវការប្រជាពលរដ្ឋជាធំ ព្រមទាំងផ្តោតលើសារ:សំខាន់នៃការប្រើប្រាស់ទិន្នន័យសម្រាប់ការសម្រេចចិត្តនានា ។",
    }, {
        id: 20,
        word: "Digital Government",
        meaning: "សំដៅដល់ ដំណើរការនៃការធ្វើទំនើបកម្មលើប្រព័ន្ធគ្រប់គ្រងរដ្ឋាភិបាលនិងសេវាសាធារណៈតាមរយៈការប្រើប្រាស់នូវបច្ចេកវិទ្យាឌីជីថល ដូចជា កុំព្យូទ័រ ឧបករណ៍ធ្លាត និងប្រព័ន្ឋអ៊ីនធឺណិតសំដៅជួយសម្រួលដល់ការ គ្រប់គ្រងកិច្ចការរដ្ឋបាលរបស់រដ្ឋ ការសម្រេចចិត្ត និងការផ្តល់សេរវាជូន ប្រជាពលរដ្ឋ វិស័យឯកជន និងស្ថាប័នពាក់ព័ន្ធនានាប្រកបដោយប្រសិទ្ធភាព តម្លាភាព គណនេយ្យភាព និងបរិយាបន្នកម្ម ។",
    }, {
        id: 21,
        word: "Internet Of Things (loT)",
        meaning: "សំដៅលើ បណ្តាញនៃវត្ថុដែលត្រូវបានតភ្ជាប់នឹងអ៊ីនធឺណិត និងមានមុខងារចាប់សញ្ញា និងអាចធ្វើអន្តរកម្មជាមួយវត្ថុផ្សេងទៀតឬមជ្ឍដ្ឋានខាងក្រៅ ។ <br/>ឧទាហរណ៍: នាឡិកាឆ្លាតវៃ <code>(Smart Watch)</code> ទូរទស្សន៍ឆ្លាតវៃ <code>(Smart TVs)</code> ប្រព័ន្ធសុវតិ្ថភាពក្នុងផ្ទះ <code>(Home Security Systems)</code> អំពូលភ្លើងបញ្ជាដោយស្វ័យប្រវត្តិ <code>(Smart Bulbs)</code> ជាដើម។",
    }, {
        id: 22,
        word: "USB",
        meaning: "<code>USB</code> ជាពាក្យហៅកាត់នៃពាក្យ <code>Universal Serial Bus</code> ដែលគេប្រើវាដើម្បីភ្ជាប់ឳ្យមានដំណើរការរវាងកុំព្យូទ័រជាមួយគ្រឿងកុំព្យូទ័រ ឬឩបករណ៍ផ្សេងទៀត។ <br><br>ឩបការណ៍ភ្ជាប់ <code>USB</code> ត្រូវបានគេប្រើប្រាស់យ៉ាងទូលំទូលាយទៅលើ ក្តារចុច និង <code>Mouse</code> កុំព្យូទ័រ រហូតដល់អាចប្រើជាមួយឩបករណ៍ចាក់តន្ត្រី ជាដើម។<br><code>UAB</code> ក៏អាចបញ្ជូនថាមពលទៅឩបករណ៍មួយចំនួនដូចជា ការផ្តល់ថាមពល ឬសាកថ្ម ដល់ស្មាតហ្វូន (<code>Smart Phone</code>) និងថេប្លេត (<code>Teblet</code>)។ ការដាក់ឳ្យប្រើប្រាស់ដំបូងបង្អស់នៃ <code>Universal Serial Bus</code> (ជំនាន់ទី ១.០) គឺនៅក្នុងខែមករា ឆ្នាំ 1996។",
    }, {
        id: 23,
        word: "Digital Adaptation",
        meaning: "សំដៅលើ សមត្ថភាពរបស់មនុស្សក្នងការយល់ដឹង និងការសម្របខ្លួនទៅតាមការវិរឌ្ឍឥតឈប់ឈររបស់បច្ចេកវិទ្យាឌីជីថលដែលចាក់ជ្រៅទៅក្នុងធុរកិច្ច សេដ្ឋកិច្ច និងសង្គម ។",
    }, {
        id: 24,
        word: "Digital Adoption",
        meaning: "សំដៅដល់ ស្ថានភាពដែលមនុស្សមានជំនាញក្នុងការប្រើប្រាស់ឧបករណ៍អេឡិចត្រូនិក ប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន និងថ្នាលឌីជីថលតាមបំណង និងឱ្យអស់លទ្ធភាព។",
    }, {
        id: 25,
        word: "Digital Business",
        meaning: "សំដៅដល់ ធុរកិច្ចដែលមានអាជីរកម្មចម្បងប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថល ឬផ្តល់សេវាឌីជីថល ឬបង្កើតផលិតផលជាបច្ចេកវិទ្យាឌីជីថល ។",
    }, {
        id: 26,
        word: "Digital Content",
        meaning: "សំដៅដល់ ខ្លឹមសារនៃព័ត៌មានក្នុងទម្រង់ឌីជីថលដែលអាចមើល អាន ស្តាប់ ឬទាញយកបានក្នុងទម្រង់ជាអត្ថបទ រូបភាព សំឡេង វីដេអូ ។ល។",
    }, {
        id: 27,
        word: "Last-Mile Delivery",
        meaning: "សំដៅដល់ ការចែកបញ្ញើដល់អ្នកប្រើប្រាស់ចុងក្រោយ តាមរយៈមធ្យោបាយផ្សេងៗ ដោយកំណត់ពេលវេលាជាក់លាក់ ឆាប់រហ័សនិងមានប្រព័ន្ធតាមដានដោយស្វ័យប្រវត្តិ។",
    },
];